tiborsimon/embedded-tdd-headers/pic/pic16/pic16c710_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16C710_H_
#define _PIC16C710_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define PORTB                         18
#define RB0                           19
#define RB1                           20
#define RB2                           21
#define RB3                           22
#define RB4                           23
#define RB5                           24
#define RB6                           25
#define RB7                           26
#define ADCON0                        27
#define ADON                          28
#define ADIF                          29
#define nDONE                         30
#define GO_nDONE                      31
#define GO_DONE                       32
#define GO                            33
#define CHS                           34
#define CHS0                          35
#define CHS1                          36
#define ADCS0                         37
#define ADCS                          38
#define ADCS1                         39
#define INTCON                        40
#define RBIF                          41
#define INTF                          42
#define T0IF                          43
#define TMR0IF                        44
#define RBIE                          45
#define INTE                          46
#define T0IE                          47
#define TMR0IE                        48
#define ADIE                          49
#define GIE                           50
#define OPTION_REG                    51
#define PS                            52
#define PS0                           53
#define PS1                           54
#define PS2                           55
#define PSA                           56
#define T0SE                          57
#define T0CS                          58
#define INTEDG                        59
#define nRBPU                         60
#define TRISA                         61
#define TRISA0                        62
#define TRISA1                        63
#define TRISA2                        64
#define TRISA3                        65
#define TRISA4                        66
#define TRISB                         67
#define TRISB0                        68
#define TRISB1                        69
#define TRISB2                        70
#define TRISB3                        71
#define TRISB4                        72
#define TRISB5                        73
#define TRISB6                        74
#define TRISB7                        75
#define PCON                          76
#define nBOR                          77
#define nBO                           78
#define nPOR                          79
#define ADCON1                        80
#define PCFG0                         81
#define PCFG                          82
#define PCFG1                         83

#endif // _PIC16C710_H_
